app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" ORDER BY created_at DESC
---
	def index
		@articles=Article.order("created_at DESC")

SELECT  "articles".* FROM "articles" ORDER BY created_at DESC LIMIT ?  [["LIMIT", 3]]
---
	def homepage
		@articles=Article.order("created_at DESC").first(3)

INSERT INTO "articles" ("title", "date", "description", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "testtt"], ["date", "20190125"], ["description", "換行\r\n換行換行"], ["body", ""], ["created_at", "2019-01-26 03:01:08.578256"], ["updated_at", "2019-01-26 03:01:08.578256"]]
---
	def create
		@article=Article.new articles_params
		@article.save

UPDATE "articles" SET "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["description", "換行<br>\r\n換行換行"], ["updated_at", "2019-01-26 03:01:20.353459"], ["id", 11]]
---
	def update

		@article.update articles_params

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
	def set_article
		@article=Article.find params[:id]